#Напишите код, который также будет использовать функцию map() и лямбда функцию. На вход будут подаваться три аргумента для range: начало, конец и шаг числовой последовательности. Нужно вывести для каждого элемента range квадрат числа, если число нечетное, иначе вывести противоположное ему. (Решение можно реализовать в две и даже в одну строку!)
a = [int(x) for x in input().split(' ')]
for i in map(lambda x: x**2 if x%2 != 0 else x * (-1), range(a[0], a[1], a[2])): print(i)